Update genai.md
